import React from 'react';

// Создание компонентов jsx
// Компонент всеегда с большой буквы

// Первый способ использование функции JavaScript:

// Щоб створити компонент з функцією, варто лише написати функцію JavaScript, яка повертає або JSX, або null. 
// Важливо відзначити, що для React важливим є початок назви вашої функції з великої літери. 
// Ось приклад функціонального компонента, який призначає клас HTML у JSX:

const FuncComponent = function() {
  return (
    <div className='customClass'>
      Привет, я компонент созданный функциональным методом!
    </div>
  );
};

export default FuncComponent;

// Після перенесення <div> матиме клас CSS customClass.

// Оскільки компонент JSX представляє HTML, ви маєте можливість об'єднати кілька компонентів разом, 
// щоб створити більш складну сторінку HTML. Це одна з ключових переваг компонентної архітектури, 
// яку надає React. Це дозволяє складати інтерфейс користувача з багатьох окремих, ізольованих компонентів. 
// Це полегшує створення та обслуговування складних інтерфейсів користувача.