// Компоненти у React мають декілька спеціальних методів, 
// що забезпечують можливість виконувати дії у визначений 
// час у їхньому життєвому циклі. Вони називаються методами 
// життєвого циклу, чи перехоплювачами життєвого циклу і 
// дозволяють виловити компонент у визначений час. 
// Це може бути до того, як вони будуть показані, 
// перш ніж вони оновляться, перш ніж вони отримають реквізити, 
// перш ніж від'єднати і так далі. Ось список декількох методів 
// життєвого циклу: 
// componentWillMount() 
// componentDidMount() 
// shouldComponentUpdate() 
// componentDidUpdate() 
// componentWillUnmount(). 
// Протягом наступних уроків розглянемо деякі основні випадки використання даних методів.

// Примітка: метод життєвого циклу componentWillMount буде 
// виключено з майбутньої версії 16.X і видалено з версії 17. (Джерело)

// Метод componentWillMount() викликається перед методом render(), 
// коли компонент підключений до DOM. Запишіть щось в консоль 
// в межах componentWillMount(); щоб побачити результат - відкрийте консоль вашого браузера.

// class MyComponent extends React.Component {
//   constructor(props) {
//     super(props);
//   }
//   componentWillMount() {
//     // Змініть код під цим рядком
// console.log('dfdfdf')
//     // Змініть код над цим рядком
//   }
//   render() {
//     return <div />
//   }
// };